app/views/messages/create.json.jbuilder

INSERT INTO `messages` (`content`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('', 'ファイト犬3.png', 6, 2, '2019-08-25 05:47:06', '2019-08-25 05:47:06')
---
json.(@message, :content)
json.created_at @message.created_at.strftime("%Y/%m/%d %H:%M")