app/views/groups/_form.html.haml

SELECT `users`.id FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 2
---
        %p.chat-group-user__name
          - group.users.each do |user|
            .chat-group-user.clearfix