app/views/groups/new.html.haml

SELECT `users`.* FROM `users`
---
        / グループ作成機能の追加時はここにcollection_check_boxesの記述を入れてください
        = f.collection_check_boxes :user_ids, User.all, :id, :name