app/controllers/groups_controller.rb

  def update
    if @group.update(group_params)
---
UPDATE `groups` SET `name` = 'rrrcrc', `updated_at` = '2019-08-23 07:35:31' WHERE `groups`.`id` = 2