app/controllers/users_controller.rb

  def update
    if current_user.update(user_params)
---
UPDATE `users` SET `email` = 'ab@a.com', `updated_at` = '2019-08-23 06:41:16' WHERE `users`.`id` = 1

  def search
    @users = User.where('id not in (?) AND name LIKE(?)',current_user.id, "%#{params[:keyword]}%")
---
SELECT `users`.* FROM `users` WHERE (id not in ('current_user.id') AND name LIKE('%t%'))